insert into teacher
values ('GV01',N'Nguyễn Ngọc Tuấn','tuannn01@gmail.com',1,'img\teacher1.jpg')

insert into teacher
values ('GV02',N'Nguyễn Thanh Hải','haint02@gmail.com',1,'img\teacher2.jpg')

insert into teacher
values ('GV03',N'Trần Minh Quân','quantm03@gmail.com',1,'img\teacher3.jpg')

insert into teacher
values ('GV04',N'Lê Hồng Đào','daolh04@gmail.com',1,'img\teacher3.jpg')

insert into teacher
values ('GV05',N'Nguyễn Giáo Viên','vienng05@gmail.com',1,'img\teacher3.jpg')

insert into teacher
values ('GV06',N'Nguyễn Danh Hài','hainn06@gmail.com',1,'img\teacher3.jpg')

insert into teacher
values ('GV07',N'Nguyễn Thị Java','javaa07@gmail.com',1,'img\teacher3.jpg')

insert into teacher
values ('GV08',N'Nguyễn Ngọc Web','webnsd0808@gmail.com',1,'img\teacher3.jpg')

insert into teacher
values ('GV09',N'Trần Thị Nhàn','nhann09@gmail.com',1,'img\teacher3.jpg')

insert into teacher
values ('GV010',N'Nguyễn Ngọc Kim','kimasd10@gmail.com',2,'img\teacher3.jpg')

insert into teacher
values ('GV011',N'Nguyễn Ngọc Liên','liessn11@gmail.com',2,'img\teacher3.jpg')

insert into teacher
values ('GV012',N'Nguyễn Ngọc Tuấn','tuannn01@gmail.com',1,'img\teacher3.jpg')

insert into class
values('10a1','10A1',5,'GV01')
,('10a2','10A2',5,'GV02')
,('11a1','11A1',5,'GV03')
,('11a2','11A2',5,'GV04')
,('12a1','12A1',5,'GV05')
,('12a2','12A2',5,'GV06')

insert into Student
values('st01',N'Nguyễn Văn An',1,'01-01-2000',N'Hà Nội','1000000000','st01@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','12a1'),
('st02',N'Nguyễn Văn Anh',1,'01-01-2000',N'Hà Nội','1000000000','st02@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','12a1'),
('st03',N'Nguyễn Văn hà',1,'01-01-2000',N'Hà Nội','1000000000','st03@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','12a1'),
('st04',N'Nguyễn Thị Tư',0,'01-01-2000',N'Hà Nội','1000000000','st04@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','12a1'),
('st05',N'Nguyễn Minh Hà',0,'01-01-2000',N'Hà Nội','1000000000','st05@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','12a1'),
('st06',N'Nguyễn Thị Minh Huệ',0,'01-01-2000',N'Hà Nội','1000000000','st06@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','12a2'),
('st07',N'Nguyễn Thị Lan',0,'01-01-2000',N'Hà Nội','1000000000','st07@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','12a2'),
('st08',N'Nguyễn Thị Nguyệt',0,'01-01-2000',N'Hà Nội','1000000000','st08@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','12a2'),
('st09',N'Nguyễn Quỳnh Chi',0,'01-01-2000',N'Hà Nội','1000000000','st09@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','12a2'),
('st010',N'Nguyễn Minh Tuấn',1,'01-01-2000',N'Hà Nội','1000000000','st010@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','12a2'),
('st021',N'Nguyễn Mạnh Hiếu',1,'01-01-2001',N'Hà Nội','1000000000','st011@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','11a1'),
('st022',N'Nguyễn Quang Hải',1,'01-01-2001',N'Hà Nội','1000000000','st012@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','11a1'),
('st023',N'Nguyễn Thị Hòe',0,'01-01-2001',N'Hà Nội','1000000000','st013@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','11a1'),
('st024',N'Nguyễn Minh Huế',0,'01-01-2001',N'Hà Nội','1000000000','st014@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','11a1'),
('st025',N'Nguyễn Quang Linh',0,'01-01-2001',N'Hà Nội','1000000000','st015@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','11a1'),
('st026',N'Trần Thị Ngọc',0,'01-01-2001',N'Hà Nội','1000000000','st016@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','11a2'),
('st027',N'Ngô Thị Ngang',0,'01-01-2001',N'Hà Nội','1000000000','st017@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','11a2'),
('st028',N'Nguyễn Thị Cường',0,'01-01-2001',N'Hà Nội','1000000000','st018@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','11a2'),
('st029',N'Lê Hồng Ngọc',0,'01-01-2001',N'Hà Nội','1000000000','st019@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','11a2'),
('st030',N'Nguyễn Minh Anh',0,'01-01-2001',N'Hà Nội','1000000000','st0111@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','11a2'),
('st041',N'Nguyễn Văn Xuân',1,'01-01-2002',N'Hà Nội','1000000000','st01112@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','10a1'),
('st042',N'Trần Văn Hà',1,'01-01-2002',N'Hà Nội','1000000000','st01123@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','10a1'),
('st043',N'Nguyễn Văn Linh',1,'01-01-2002',N'Hà Nội','1000000000','st01234@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','10a1'),
('st044',N'Ngô Văn Lê',1,'01-01-2002',N'Hà Nội','1000000000','st013111@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','10a1'),
('st045',N'Nguyễn Thanh Hiếu',1,'01-01-2002',N'Hà Nội','1000000000','st01e12@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','10a1'),
('st046',N'Nguyễn Trần Anh Quân',1,'01-01-2002',N'Hà Nội','1000000000','st011we@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','10a2'),
('st047',N'Nguyễn Văn Linh',1,'01-01-2002',N'Hà Nội','1000000000','st0114223@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','10a2'),
('st048',N'Nguyễn Anh Hà',1,'01-01-2002',N'Hà Nội','1000000000','st019999@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','10a2'),
('st049',N'Nguyễn Văn Hải',1,'01-01-2002',N'Hà Nội','1000000000','st01000@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','10a2'),
('st050',N'Nguyễn Linh Văn',1,'01-01-2002',N'Hà Nội','1000000000','st0123432@gmail.com','0900000000',N'Nguyễn Văn Hà','0300000000','img\hs1.jpg','10a2')

insert into learn
values(2019,'01-01-2019','01-01-2020','12a1','st01'),
(2019,'01-01-2019','01-01-2020','12a1','st02'),
(2019,'01-01-2019','01-01-2020','12a1','st03'),
(2019,'01-01-2019','01-01-2020','12a1','st04'),
(2019,'01-01-2019','01-01-2020','12a1','st05'),
(2019,'01-01-2019','01-01-2020','12a2','st06'),
(2019,'01-01-2019','01-01-2020','12a2','st07'),
(2019,'01-01-2019','01-01-2020','12a2','st08'),
(2019,'01-01-2019','01-01-2020','12a2','st09'),
(2019,'01-01-2019','01-01-2020','12a2','st010'),
(2018,'01-01-2018','01-01-2019','11a1','st01'),
(2018,'01-01-2018','01-01-2019','11a1','st02'),
(2018,'01-01-2018','01-01-2019','11a1','st03'),
(2018,'01-01-2018','01-01-2019','11a1','st04'),
(2018,'01-01-2018','01-01-2019','11a1','st05'),
(2018,'01-01-2018','01-01-2019','11a2','st06'),
(2018,'01-01-2018','01-01-2019','11a2','st07'),
(2018,'01-01-2018','01-01-2019','11a2','st08'),
(2018,'01-01-2018','01-01-2019','11a2','st09'),
(2018,'01-01-2018','01-01-2019','11a2','st010'),
(2017,'01-01-2017','01-01-2018','10a1','st01'),
(2017,'01-01-2017','01-01-2018','10a1','st02'),
(2017,'01-01-2017','01-01-2018','10a1','st03'),
(2017,'01-01-2017','01-01-2018','10a1','st04'),
(2017,'01-01-2017','01-01-2018','10a1','st05'),
(2017,'01-01-2017','01-01-2018','10a2','st06'),
(2017,'01-01-2017','01-01-2018','10a2','st07'),
(2017,'01-01-2017','01-01-2018','10a2','st08'),
(2017,'01-01-2017','01-01-2018','10a2','st09'),
(2017,'01-01-2017','01-01-2018','10a2','st010'),

(2019,'01-01-2019','01-01-2020','11a1','st021'),
(2019,'01-01-2019','01-01-2020','11a1','st022'),
(2019,'01-01-2019','01-01-2020','11a1','st023'),
(2019,'01-01-2019','01-01-2020','11a1','st024'),
(2019,'01-01-2019','01-01-2020','11a2','st025'),
(2019,'01-01-2019','01-01-2020','11a2','st026'),
(2019,'01-01-2019','01-01-2020','11a2','st027'),
(2019,'01-01-2019','01-01-2020','11a2','st028'),
(2019,'01-01-2019','01-01-2020','11a2','st029'),
(2019,'01-01-2019','01-01-2020','11a2','st030'),
(2018,'01-01-2018','01-01-2019','10a1','st021'),
(2018,'01-01-2018','01-01-2019','10a1','st022'),
(2018,'01-01-2018','01-01-2019','10a1','st023'),
(2018,'01-01-2018','01-01-2019','10a1','st024'),
(2018,'01-01-2018','01-01-2019','10a1','st025'),
(2018,'01-01-2018','01-01-2019','10a2','st026'),
(2018,'01-01-2018','01-01-2019','10a2','st027'),
(2018,'01-01-2018','01-01-2019','10a2','st028'),
(2018,'01-01-2018','01-01-2019','10a2','st029'),
(2018,'01-01-2018','01-01-2019','10a2','st030'),

(2019,'01-01-2019','01-01-2020','10a1','st041'),
(2019,'01-01-2019','01-01-2020','10a1','st042'),
(2019,'01-01-2019','01-01-2020','10a1','st043'),
(2019,'01-01-2019','01-01-2020','10a1','st044'),
(2019,'01-01-2019','01-01-2020','10a2','st045'),
(2019,'01-01-2019','01-01-2020','10a2','st046'),
(2019,'01-01-2019','01-01-2020','10a2','st047'),
(2019,'01-01-2019','01-01-2020','10a2','st048'),
(2019,'01-01-2019','01-01-2020','10a2','st049'),
(2019,'01-01-2019','01-01-2020','10a2','st050')

